redis_benchmark/test/withKubearmor3_10000000.txt
====== GET ======
  10026008 requests completed in 5.43 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 55.263 milliseconds (cumulative count 1000)
50.000% <= 271.615 milliseconds (cumulative count 5013000)
75.000% <= 366.847 milliseconds (cumulative count 7501320)
87.500% <= 404.991 milliseconds (cumulative count 8763320)
93.750% <= 427.263 milliseconds (cumulative count 9376320)
96.875% <= 530.943 milliseconds (cumulative count 9690320)
98.438% <= 544.767 milliseconds (cumulative count 9846816)
99.219% <= 548.351 milliseconds (cumulative count 9923080)
99.609% <= 551.423 milliseconds (cumulative count 9963080)
99.805% <= 560.127 milliseconds (cumulative count 9982960)
99.902% <= 561.151 milliseconds (cumulative count 9990912)
99.951% <= 566.271 milliseconds (cumulative count 9997728)
99.988% <= 566.783 milliseconds (cumulative count 10000000)
100.000% <= 566.783 milliseconds (cumulative count 10000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.140% <= 56.127 milliseconds (cumulative count 14000)
0.190% <= 57.119 milliseconds (cumulative count 19000)
0.200% <= 59.103 milliseconds (cumulative count 20000)
0.440% <= 60.127 milliseconds (cumulative count 44000)
0.680% <= 61.119 milliseconds (cumulative count 68000)
0.790% <= 62.111 milliseconds (cumulative count 79000)
0.960% <= 63.103 milliseconds (cumulative count 96000)
1.100% <= 64.127 milliseconds (cumulative count 110000)
1.140% <= 65.119 milliseconds (cumulative count 114000)
1.150% <= 66.111 milliseconds (cumulative count 115000)
1.190% <= 203.135 milliseconds (cumulative count 119000)
1.300% <= 204.159 milliseconds (cumulative count 130000)
1.490% <= 205.183 milliseconds (cumulative count 149000)
1.750% <= 206.207 milliseconds (cumulative count 175000)
1.960% <= 207.103 milliseconds (cumulative count 196000)
2.370% <= 208.127 milliseconds (cumulative count 237000)
2.770% <= 209.151 milliseconds (cumulative count 277000)
3.170% <= 210.175 milliseconds (cumulative count 317000)
3.600% <= 211.199 milliseconds (cumulative count 360000)
4.000% <= 212.223 milliseconds (cumulative count 400000)
4.370% <= 213.119 milliseconds (cumulative count 437000)
4.650% <= 214.143 milliseconds (cumulative count 465000)
4.940% <= 215.167 milliseconds (cumulative count 494000)
5.450% <= 216.191 milliseconds (cumulative count 545000)
5.860% <= 217.215 milliseconds (cumulative count 586000)
6.200% <= 218.111 milliseconds (cumulative count 620000)
6.700% <= 219.135 milliseconds (cumulative count 670000)
7.290% <= 220.159 milliseconds (cumulative count 729000)
8.110% <= 221.183 milliseconds (cumulative count 811000)
8.920% <= 222.207 milliseconds (cumulative count 892000)
9.730% <= 223.103 milliseconds (cumulative count 973000)
10.570% <= 224.127 milliseconds (cumulative count 1057000)
11.300% <= 225.151 milliseconds (cumulative count 1130000)
12.010% <= 226.175 milliseconds (cumulative count 1201000)
12.710% <= 227.199 milliseconds (cumulative count 1271000)
13.640% <= 228.223 milliseconds (cumulative count 1364000)
14.500% <= 229.119 milliseconds (cumulative count 1450000)
15.620% <= 230.143 milliseconds (cumulative count 1562000)
16.760% <= 231.167 milliseconds (cumulative count 1676000)
17.910% <= 232.191 milliseconds (cumulative count 1791000)
19.030% <= 233.215 milliseconds (cumulative count 1903000)
19.950% <= 234.111 milliseconds (cumulative count 1995000)
20.980% <= 235.135 milliseconds (cumulative count 2098000)
22.010% <= 236.159 milliseconds (cumulative count 2201000)
22.990% <= 237.183 milliseconds (cumulative count 2299000)
23.970% <= 238.207 milliseconds (cumulative count 2397000)
24.620% <= 239.103 milliseconds (cumulative count 2462000)
25.380% <= 240.127 milliseconds (cumulative count 2538000)
26.220% <= 241.151 milliseconds (cumulative count 2622000)
27.210% <= 242.175 milliseconds (cumulative count 2721000)
28.240% <= 243.199 milliseconds (cumulative count 2824000)
29.250% <= 244.223 milliseconds (cumulative count 2925000)
30.130% <= 245.119 milliseconds (cumulative count 3013000)
31.280% <= 246.143 milliseconds (cumulative count 3128000)
32.310% <= 247.167 milliseconds (cumulative count 3231000)
33.240% <= 248.191 milliseconds (cumulative count 3324000)
34.220% <= 249.215 milliseconds (cumulative count 3422000)
35.010% <= 250.111 milliseconds (cumulative count 3501000)
35.770% <= 251.135 milliseconds (cumulative count 3577000)
36.640% <= 252.159 milliseconds (cumulative count 3664000)
37.360% <= 253.183 milliseconds (cumulative count 3736000)
38.020% <= 254.207 milliseconds (cumulative count 3802000)
38.600% <= 255.103 milliseconds (cumulative count 3860000)
39.110% <= 256.127 milliseconds (cumulative count 3911000)
39.830% <= 257.151 milliseconds (cumulative count 3983000)
40.510% <= 258.175 milliseconds (cumulative count 4051000)
41.170% <= 259.199 milliseconds (cumulative count 4117000)
41.730% <= 260.223 milliseconds (cumulative count 4173000)
42.220% <= 261.119 milliseconds (cumulative count 4222000)
42.800% <= 262.143 milliseconds (cumulative count 4280000)
43.350% <= 263.167 milliseconds (cumulative count 4335000)
44.040% <= 264.191 milliseconds (cumulative count 4404000)
44.740% <= 265.215 milliseconds (cumulative count 4474000)
45.480% <= 266.239 milliseconds (cumulative count 4548000)
46.270% <= 267.263 milliseconds (cumulative count 4627000)
47.120% <= 268.287 milliseconds (cumulative count 4712000)
48.000% <= 269.311 milliseconds (cumulative count 4800000)
48.900% <= 270.335 milliseconds (cumulative count 4890000)
49.650% <= 271.103 milliseconds (cumulative count 4965000)
50.510% <= 272.127 milliseconds (cumulative count 5051000)
51.220% <= 273.151 milliseconds (cumulative count 5122000)
51.900% <= 274.175 milliseconds (cumulative count 5190000)
52.340% <= 275.199 milliseconds (cumulative count 5234000)
52.820% <= 276.223 milliseconds (cumulative count 5282000)
53.270% <= 277.247 milliseconds (cumulative count 5327000)
53.680% <= 278.271 milliseconds (cumulative count 5368000)
53.970% <= 279.295 milliseconds (cumulative count 5397000)
54.270% <= 280.319 milliseconds (cumulative count 5427000)
54.690% <= 281.343 milliseconds (cumulative count 5469000)
55.000% <= 282.111 milliseconds (cumulative count 5500000)
55.280% <= 283.135 milliseconds (cumulative count 5528000)
55.560% <= 284.159 milliseconds (cumulative count 5556000)
55.880% <= 285.183 milliseconds (cumulative count 5588000)
56.180% <= 286.207 milliseconds (cumulative count 5618000)
56.460% <= 287.231 milliseconds (cumulative count 5646000)
56.616% <= 288.255 milliseconds (cumulative count 5661568)
57.021% <= 289.279 milliseconds (cumulative count 5702088)
57.456% <= 290.303 milliseconds (cumulative count 5745608)
57.831% <= 291.327 milliseconds (cumulative count 5783128)
58.185% <= 292.351 milliseconds (cumulative count 5818512)
58.438% <= 293.119 milliseconds (cumulative count 5843760)
58.813% <= 294.143 milliseconds (cumulative count 5881280)
59.158% <= 295.167 milliseconds (cumulative count 5915800)
59.678% <= 296.191 milliseconds (cumulative count 5967752)
60.063% <= 297.215 milliseconds (cumulative count 6006320)
60.333% <= 298.239 milliseconds (cumulative count 6033320)
60.553% <= 299.263 milliseconds (cumulative count 6055320)
60.833% <= 300.287 milliseconds (cumulative count 6083320)
60.983% <= 301.311 milliseconds (cumulative count 6098320)
61.133% <= 302.335 milliseconds (cumulative count 6113320)
61.263% <= 303.103 milliseconds (cumulative count 6126320)
61.403% <= 304.127 milliseconds (cumulative count 6140320)
61.563% <= 305.151 milliseconds (cumulative count 6156320)
61.793% <= 306.175 milliseconds (cumulative count 6179320)
62.203% <= 307.199 milliseconds (cumulative count 6220320)
62.643% <= 308.223 milliseconds (cumulative count 6264320)
62.953% <= 309.247 milliseconds (cumulative count 6295320)
63.243% <= 310.271 milliseconds (cumulative count 6324320)
63.533% <= 311.295 milliseconds (cumulative count 6353320)
63.803% <= 312.319 milliseconds (cumulative count 6380320)
63.923% <= 313.343 milliseconds (cumulative count 6392320)
63.973% <= 314.111 milliseconds (cumulative count 6397320)
64.123% <= 315.135 milliseconds (cumulative count 6412320)
64.283% <= 316.159 milliseconds (cumulative count 6428320)
64.513% <= 317.183 milliseconds (cumulative count 6451320)
64.673% <= 318.207 milliseconds (cumulative count 6467320)
64.783% <= 319.231 milliseconds (cumulative count 6478320)
64.923% <= 320.255 milliseconds (cumulative count 6492320)
65.193% <= 321.279 milliseconds (cumulative count 6519320)
65.473% <= 322.303 milliseconds (cumulative count 6547320)
65.753% <= 323.327 milliseconds (cumulative count 6575320)
66.033% <= 324.351 milliseconds (cumulative count 6603320)
66.253% <= 325.119 milliseconds (cumulative count 6625320)
66.453% <= 326.143 milliseconds (cumulative count 6645320)
66.563% <= 327.167 milliseconds (cumulative count 6656320)
66.693% <= 328.191 milliseconds (cumulative count 6669320)
66.833% <= 329.215 milliseconds (cumulative count 6683320)
66.963% <= 330.239 milliseconds (cumulative count 6696320)
67.103% <= 331.263 milliseconds (cumulative count 6710320)
67.303% <= 332.287 milliseconds (cumulative count 6730320)
67.573% <= 333.311 milliseconds (cumulative count 6757320)
67.803% <= 334.335 milliseconds (cumulative count 6780320)
68.013% <= 335.103 milliseconds (cumulative count 6801320)
68.283% <= 336.127 milliseconds (cumulative count 6828320)
68.563% <= 337.151 milliseconds (cumulative count 6856320)
68.843% <= 338.175 milliseconds (cumulative count 6884320)
69.113% <= 339.199 milliseconds (cumulative count 6911320)
69.393% <= 340.223 milliseconds (cumulative count 6939320)
69.583% <= 341.247 milliseconds (cumulative count 6958320)
69.753% <= 342.271 milliseconds (cumulative count 6975320)
69.933% <= 343.295 milliseconds (cumulative count 6993320)
70.083% <= 344.319 milliseconds (cumulative count 7008320)
70.243% <= 345.343 milliseconds (cumulative count 7024320)
70.363% <= 346.111 milliseconds (cumulative count 7036320)
70.543% <= 347.135 milliseconds (cumulative count 7054320)
70.733% <= 348.159 milliseconds (cumulative count 7073320)
70.913% <= 349.183 milliseconds (cumulative count 7091320)
71.073% <= 350.207 milliseconds (cumulative count 7107320)
71.193% <= 351.231 milliseconds (cumulative count 7119320)
71.323% <= 353.279 milliseconds (cumulative count 7132320)
71.393% <= 354.303 milliseconds (cumulative count 7139320)
71.683% <= 355.327 milliseconds (cumulative count 7168320)
71.983% <= 356.351 milliseconds (cumulative count 7198320)
72.193% <= 357.119 milliseconds (cumulative count 7219320)
72.483% <= 358.143 milliseconds (cumulative count 7248320)
72.683% <= 359.167 milliseconds (cumulative count 7268320)
72.773% <= 360.191 milliseconds (cumulative count 7277320)
73.063% <= 361.215 milliseconds (cumulative count 7306320)
73.343% <= 362.239 milliseconds (cumulative count 7334320)
73.633% <= 363.263 milliseconds (cumulative count 7363320)
74.043% <= 364.287 milliseconds (cumulative count 7404320)
74.443% <= 365.311 milliseconds (cumulative count 7444320)
74.813% <= 366.335 milliseconds (cumulative count 7481320)
75.083% <= 367.103 milliseconds (cumulative count 7508320)
75.383% <= 368.127 milliseconds (cumulative count 7538320)
75.643% <= 369.151 milliseconds (cumulative count 7564320)
75.843% <= 370.175 milliseconds (cumulative count 7584320)
76.163% <= 371.199 milliseconds (cumulative count 7616320)
76.383% <= 372.223 milliseconds (cumulative count 7638320)
76.633% <= 373.247 milliseconds (cumulative count 7663320)
77.043% <= 374.271 milliseconds (cumulative count 7704320)
77.433% <= 375.295 milliseconds (cumulative count 7743320)
78.013% <= 376.319 milliseconds (cumulative count 7801320)
78.593% <= 377.343 milliseconds (cumulative count 7859320)
78.923% <= 378.111 milliseconds (cumulative count 7892320)
79.333% <= 379.135 milliseconds (cumulative count 7933320)
79.723% <= 380.159 milliseconds (cumulative count 7972320)
80.163% <= 381.183 milliseconds (cumulative count 8016320)
80.533% <= 382.207 milliseconds (cumulative count 8053320)
80.823% <= 383.231 milliseconds (cumulative count 8082320)
80.963% <= 384.255 milliseconds (cumulative count 8096320)
81.113% <= 385.279 milliseconds (cumulative count 8111320)
81.253% <= 386.303 milliseconds (cumulative count 8125320)
81.403% <= 387.327 milliseconds (cumulative count 8140320)
81.533% <= 388.351 milliseconds (cumulative count 8153320)
81.693% <= 389.119 milliseconds (cumulative count 8169320)
81.983% <= 390.143 milliseconds (cumulative count 8198320)
82.273% <= 391.167 milliseconds (cumulative count 8227320)
82.563% <= 392.191 milliseconds (cumulative count 8256320)
82.843% <= 393.215 milliseconds (cumulative count 8284320)
83.073% <= 394.239 milliseconds (cumulative count 8307320)
83.223% <= 395.263 milliseconds (cumulative count 8322320)
83.493% <= 396.287 milliseconds (cumulative count 8349320)
83.993% <= 397.311 milliseconds (cumulative count 8399320)
84.513% <= 398.335 milliseconds (cumulative count 8451320)
84.833% <= 399.103 milliseconds (cumulative count 8483320)
85.213% <= 400.127 milliseconds (cumulative count 8521320)
85.643% <= 401.151 milliseconds (cumulative count 8564320)
86.083% <= 402.175 milliseconds (cumulative count 8608320)
86.573% <= 403.199 milliseconds (cumulative count 8657320)
87.193% <= 404.223 milliseconds (cumulative count 8719320)
87.783% <= 405.247 milliseconds (cumulative count 8778320)
88.503% <= 406.271 milliseconds (cumulative count 8850320)
89.103% <= 407.295 milliseconds (cumulative count 8910320)
89.433% <= 408.319 milliseconds (cumulative count 8943320)
89.853% <= 409.343 milliseconds (cumulative count 8985320)
90.183% <= 410.111 milliseconds (cumulative count 9018320)
90.493% <= 411.135 milliseconds (cumulative count 9049320)
90.653% <= 412.159 milliseconds (cumulative count 9065320)
90.833% <= 413.183 milliseconds (cumulative count 9083320)
91.113% <= 414.207 milliseconds (cumulative count 9111320)
91.413% <= 415.231 milliseconds (cumulative count 9141320)
91.573% <= 416.255 milliseconds (cumulative count 9157320)
91.743% <= 417.279 milliseconds (cumulative count 9174320)
92.013% <= 418.303 milliseconds (cumulative count 9201320)
92.283% <= 419.327 milliseconds (cumulative count 9228320)
92.443% <= 420.351 milliseconds (cumulative count 9244320)
92.633% <= 421.119 milliseconds (cumulative count 9263320)
92.923% <= 422.143 milliseconds (cumulative count 9292320)
93.213% <= 423.167 milliseconds (cumulative count 9321320)
93.363% <= 424.191 milliseconds (cumulative count 9336320)
93.503% <= 425.215 milliseconds (cumulative count 9350320)
93.623% <= 426.239 milliseconds (cumulative count 9362320)
93.763% <= 427.263 milliseconds (cumulative count 9376320)
93.893% <= 428.287 milliseconds (cumulative count 9389320)
93.963% <= 429.311 milliseconds (cumulative count 9396320)
94.023% <= 475.135 milliseconds (cumulative count 9402320)
94.093% <= 476.159 milliseconds (cumulative count 9409320)
94.233% <= 477.183 milliseconds (cumulative count 9423320)
94.243% <= 478.207 milliseconds (cumulative count 9424320)
94.273% <= 487.167 milliseconds (cumulative count 9427320)
94.293% <= 488.191 milliseconds (cumulative count 9429320)
94.333% <= 493.311 milliseconds (cumulative count 9433320)
94.473% <= 494.335 milliseconds (cumulative count 9447320)
94.593% <= 495.103 milliseconds (cumulative count 9459320)
94.743% <= 496.127 milliseconds (cumulative count 9474320)
94.903% <= 497.151 milliseconds (cumulative count 9490320)
95.063% <= 498.175 milliseconds (cumulative count 9506320)
95.163% <= 499.199 milliseconds (cumulative count 9516320)
95.293% <= 500.223 milliseconds (cumulative count 9529320)
95.323% <= 510.207 milliseconds (cumulative count 9532320)
95.463% <= 511.231 milliseconds (cumulative count 9546320)
95.603% <= 512.255 milliseconds (cumulative count 9560320)
95.743% <= 513.279 milliseconds (cumulative count 9574320)
95.883% <= 514.303 milliseconds (cumulative count 9588320)
96.023% <= 515.327 milliseconds (cumulative count 9602320)
96.143% <= 516.351 milliseconds (cumulative count 9614320)
96.243% <= 517.119 milliseconds (cumulative count 9624320)
96.383% <= 518.143 milliseconds (cumulative count 9638320)
96.523% <= 519.167 milliseconds (cumulative count 9652320)
96.663% <= 520.191 milliseconds (cumulative count 9666320)
96.783% <= 521.215 milliseconds (cumulative count 9678320)
96.833% <= 530.431 milliseconds (cumulative count 9683320)
96.943% <= 531.455 milliseconds (cumulative count 9694320)
97.003% <= 533.503 milliseconds (cumulative count 9700320)
97.053% <= 534.527 milliseconds (cumulative count 9705320)
97.073% <= 535.551 milliseconds (cumulative count 9707320)
97.183% <= 536.575 milliseconds (cumulative count 9718320)
97.233% <= 537.599 milliseconds (cumulative count 9723320)
97.303% <= 538.111 milliseconds (cumulative count 9730320)
97.553% <= 539.135 milliseconds (cumulative count 9755320)
97.675% <= 540.159 milliseconds (cumulative count 9767504)
97.805% <= 541.183 milliseconds (cumulative count 9780504)
97.945% <= 542.207 milliseconds (cumulative count 9794504)
98.153% <= 543.231 milliseconds (cumulative count 9815320)
98.358% <= 544.255 milliseconds (cumulative count 9835840)
98.594% <= 545.279 milliseconds (cumulative count 9859360)
98.809% <= 546.303 milliseconds (cumulative count 9880880)
99.034% <= 547.327 milliseconds (cumulative count 9903400)
99.231% <= 548.351 milliseconds (cumulative count 9923080)
99.371% <= 549.375 milliseconds (cumulative count 9937080)
99.511% <= 550.399 milliseconds (cumulative count 9951080)
99.631% <= 551.423 milliseconds (cumulative count 9963080)
99.705% <= 558.591 milliseconds (cumulative count 9970464)
99.744% <= 559.103 milliseconds (cumulative count 9974440)
99.830% <= 560.127 milliseconds (cumulative count 9982960)
99.909% <= 561.151 milliseconds (cumulative count 9990912)
99.915% <= 562.175 milliseconds (cumulative count 9991480)
99.926% <= 565.247 milliseconds (cumulative count 9992616)
99.977% <= 566.271 milliseconds (cumulative count 9997728)
100.000% <= 567.295 milliseconds (cumulative count 10000000)

Summary:
  throughput summary: 1844711.75 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      303.258    55.232   271.615   497.919   547.327   566.783